<template>
  <BasePageHeading title="Панель урпавления" :subtitle="`Добро пожаловать!`"/>
  <div class="content">
    <BaseBlock>
      <template #content>
        <div class="block-content block-content-full">
          <h2>Химчистка в Ташкенте Чистые ковры в каждом доме!</h2>
          <p>Мы используем современное, высокотехнологичное оборудование <br> и профессиональные,
            гипоаллергенные моющие средства.</p>
          <h2>Услуги</h2>
          <img class="w-100" src="@/assets/Screenshot_1.png" alt="">
          <h2>О компании</h2>
          <p>
            Сеть химчисток Black & White предоставляет европейский уровень сервиса для тех, кто
            знает цену своему времени. Вы заботитесь о своих вещах, а мы работаем, чтобы возложить часть Ваших забот на
            себя. Сегодня Black & White – это молодой, активно развивающийся бренд. Мы используем многолетний
            наработанный опыт, чтобы оказывать полный перечень услуг по химчистке одежды, индивидуальной стирке, чистке
            домашнего текстиля, замши, кожи и меха, а также ручной чистке сумок и обуви. Правильное человеческое
            отношение на каждом этапе работы отражается на результате. Мы стремимся к тому, чтобы Black & White стал
            синонимом качества и высокого уровня сервиса.
          </p>
        </div>
      </template>
    </BaseBlock>
  </div>
</template>
<script setup>
</script>
