<template>
  <BaseModal title="Уловия компании" id="accept-order-terms">
    <template #content>
      <div class="block-content block-content-full">
        Условия выполнения заказа:

        <p>
          1.   Химчистка осуществляется по заданию заказчика, в соответствии с требованиями ГОСТ РУз исполнитель вправе
          применять все виды обработки, рекомендованные изготовителем (маркировкой ГОСТ РУз). «Услуги бытовые.
          Химическая чистка, аквачистка, экочистка, общие технические условия.»
        </p>
        <p>
          2.   Изделия без маркировки, либо имеющие неполную маркировку, принимаются только с согласия Заказчика, при
          этом возможна утрата потребительских свойств изделия. Химчистка снимает с себя всю ответственность за порчу
          вещей в случае неправильной информации о  способе чистки изделия изготовителем. При наличии особых свойств
          ткани и загрязнений, требующих применения запрещённого маркировкой вида обработки, изделие принимается
          только с согласия Заказчика, при этом возможна утрата потребительских свойств изделия  и проявление скрытых
          дефектов.
        </p>
       <p>
         3.   Исполнитель предупреждает заказчика о том, что пятна от крови, краски, растительных масел, лекарств, духов,
         дезодорантов, вина с добавками красителя, жировые пятна , пятна неизвестного происхождения, застарелые пятна,
         затеки, закрасы, желтизна и пятна, закреплённые самостоятельной чисткой в домашних условиях, плохо поддаются
         выведению. Изделия с такими пятнами принимаются без гарантии пятновыводки, без претензий со стороны
         Заказчика.
       </p>
       <p>
         4.   Недостатки и дефекты на изделии, которые не устраняются : желтизна и серость на подкладочном материале,
         вследствие интенсивного  трения;  выгар ткани(измениние цветового тона); вытирание волокон с нарушением
         структуры ткани; полосы от изгиба; белёсость от трения(серость) ; усадка подкладочного материала; свяленность
         и усадка пуха (уменьшение объёма пуха и пера); закрас ткани от  грязного пуха; желтизна, выгар меха у меховых
         изделий; скатанность, свяленнность  утеплителя из пуха, пера,  синтепона.
         После химической чистки допускаются: дефекты, выявленные при приёме изделия, проявившиеся скрытые
         производственные и эксплуатационные дефекты; белесые полосы и вытертость в  местах наибольшего износа
         на изделиях из всех видов материалов; вытравки от дорожной грязи; желтизна и  изменение цвета, образовавшиеся
         от длительного воздействия пота, атмосферных условий; нарушение целостности изделия, а также спуск петель на
         трикотажных изделиях из-за продолжительной носки или в местах повреждения личинами моли или пеплом
         сигарет, проявившиеся, после химической стирки; запалы, пожелтение и белесые участки возникшие при
         неправильном глажении  в домашних условиях; заломы и расслаивание  на изделиях из дублированных текстильных
         материалов, выпадение ворса с поверхностей изделий из  искусственного бархата ; затеки, образовавшиеся
         при обработке в домашних условиях.
       </p>
      <p>
        5.   Обувь и кожаные изделия с пятнами от зимних реагентов, от слюны животных, пятнами неизвестного происхождения,
        застарелыми пятнами, с любимыми пятнами после попытки их самостоятельного удаления, с деталями из искусственных
        материалов, а также с сильно вытертой кожей и замшей, принимаются без претензии к обработке.
      </p>
       <p>
         6.   В случае сильного износа  и ветхости изделия , химчистка не отвечает за возможные механические повреждения
         в процессе обработки. При наличии на изделии искусственных материалов, запрещённых в химчистке , а также несъёмной
         фурнитуры , возможно повреждение изделия в процессе химчистки.
       </p>
       <p>
         7.   Срок исполнения заказа может быть изменён только по согласованию сторон.
       </p>
      <p>
        8.   Стороны согласны, что оценка стоимости изделия при приёме не производится.
      </p>
       <p>
         9.   При приёме-передаче заказа, Заказчик осматривает изделие и, в случае выявления недостатков в выполнении заказа,
         предъявляет соответствующие требования Исполнителю. В случае, если заказчик принимает изделие без осмотра, заказ
         считается принятым без замечаний.
       </p>
        <p>
          10.   Исполнитель осуществляет сбор и доставку вещей до предприятия. Приёмка  с детальным заполнением квитанции,
          производится приёмщиком непосредственно на фабрике. По результатам приёмки могут быть обнаружены
          дополнительные дефекты или детали, что потребует отдельного согласования с заказчиком перед началом обработки.
          Исполнитель не несёт ответственность за дефекты, выявленные при проведение приёмки. Стоимость работы по
          итогам приёмки может быть скорректирована.
        </p>
        <p>
          11.   Срок ответственного хранения выполненного заказа не более 14 дней. 
          О неустранимых дефектах, последствиях  химчистки, в случае некачественного изготовления изделия и
          недостоверной информации по уходу за изделием (или отсутствию таковой) ПРЕДУПРЕЖДЕН. С выше изложенным
          в пп, 1-11 условиями приёма изделий в обработку, сроком выполнения заказа, дефектами изделий, их оценкой и
          износом ОЗНАКОМЛЕН и СОГЛАСЕН. Карманы проверены.
        </p>
        <p>
          12.Если по какой либо причине происходит отказ от предоставления услуг химчистки  со стороны клиента ,клиент
          обязуется оплатить транспортные расходы.   
        </p>
      </div>
    </template>
    <template #footer>
      <button
          type="button"
          class="btn btn-sm btn-alt-secondary"
          data-bs-dismiss="modal"
      >
        Закрыть
      </button>
    </template>
  </BaseModal>
</template>

<script setup>
import BaseModal from "@/components/BaseModal.vue";
import { onMounted, ref, defineComponent } from "vue";
const modal = ref(null)

onMounted(() => {
  modal.value = new window.bootstrap.Modal('#accept-order-terms')
})
defineComponent({name: 'UserOrderTerms'})
</script>

